{
  "nav": {
    "about": "Über mich",
    "aboutDescription": "Lerne mich kennen",
    "technologies": "Technologien",
    "technologiesDescription": "Mein Tech-Stack",
    "projects": "Projekte",
    "projectsDescription": "Was ich gebaut habe",
    "hobbies": "Hobbys",
    "hobbiesDescription": "Leben jenseits des Codes",
    "contact": "Kontakt",
    "contactDescription": "Lass uns vernetzen",
    "language": "Sprache"
  },
  "home": {
    "title": "Enno Lohmann",
    "subtitle": "Fullstack-Entwickler & Software-Architekt",
    "description": "Ich bin ein leidenschaftlicher Fullstack-Entwickler, der es liebt, Software-Lösungen mit Java und modernen Web-Frameworks zu entwickeln. Seit über acht Jahren helfe ich Kunden aus verschiedenen Branchen dabei, ihre Ideen in die Realität umzusetzen.",
    "experienceTitle": "ERFAHRUNG",
    "experienceText": "Ob in kleinen Drei-Entwickler-Teams oder bei großen digitalen Transformationsprojekten mit über 120 Stakeholdern – ich blühe in kollaborativen Umgebungen auf, wo großartige Ideen durch Teamarbeit zum Leben erweckt werden.",
    "qualityTitle": "QUALITÄT",
    "qualityText": "Ich glaube daran, Software zu entwickeln, die wirklich einen Unterschied macht. Durch sauberen, wartbaren Code, gründliche Tests und intelligente Performance-Optimierung stelle ich sicher, dass jedes Projekt höchste Standards erfüllt.",
    "stats": {
      "yearsExperience": "Jahre Erfahrung",
      "projectStakeholders": "Projekt-Stakeholder",
      "technologiesMastered": "Beherrschte Technologien"
    },
    "journeyTitle": "Meine Reise",
    "journeyText1": "Meine Liebe zur Softwareentwicklung begann vor über acht Jahren, und seitdem war es eine unglaubliche Reise. Ich hatte die Chance, an allem zu arbeiten – von großen Versicherungsplattformen bis hin zu innovativen Fallmanagementsystemen für Regierungsbehörden.",
    "journeyText2": "Was mich wirklich antreibt, ist dieser Sweet Spot, wo technische Exzellenz auf echte menschliche Bedürfnisse trifft. Ob ich Full-Stack-Lösungen mit Java und Angular entwickle oder Cloud-native Anwendungen entwerfe – ich denke immer an die Menschen, die das nutzen werden, was ich erschaffe.",
    "journeyText3": "Aber hier ist, was ich gelernt habe: Die beste Software entsteht nicht in Isolation. Ich liebe es, Umgebungen zu schaffen, wo Wissen frei fließt – ob beim Mentoring von Junior-Entwicklern oder bei funktionsübergreifenden Workshops. Großartige Ideen entstehen, wenn verschiedene Perspektiven zusammenkommen.",
    "currentFocusTitle": "Aktueller Fokus",
    "currentFocusText": "Gerade leite ich die Full-Stack-Entwicklung von Versicherungsplattformen der nächsten Generation. Es ist spannende Arbeit, die moderne Web-Technologien mit robusten Backend-Systemen kombiniert, um die Art zu revolutionieren, wie Kunden Versicherungsdienstleistungen erleben.",
    "philosophyTitle": "Meine Philosophie",
    "philosophyText": "Qualitätscode bedeutet nicht nur, Bugs zu vermeiden – es geht darum, Lösungen zu schaffen, die Menschen tatsächlich warten, skalieren und als wirklich nützlich empfinden können. Jede Zeile Code sollte einen Zweck haben und zu etwas Größerem beitragen.",
    "beyondCodeTitle": "Jenseits des Codes",
    "beyondCodeText": "Wenn ich nicht gerade Software entwickle, findest du mich beim Erkunden virtueller Welten in meinen Lieblingsspielen, beim Training mit meinen vierbeinigen Begleitern oder beim Nerden über die neuesten Tech-Innovationen.",
    "gamingTitle": "Gaming-Enthusiast",
    "gamingText": "Vom strategischen Denken in Age of Empires bis zum Erobern der herausfordernden Welten von Dark Souls",
    "dogTrainingTitle": "Hundetraining",
    "dogTrainingText": "Starke Bindungen und klare Kommunikation mit meinen vierbeinigen Begleitern aufbauen",
    "techInnovationTitle": "Tech-Innovation",
    "techInnovationText": "Immer auf der Suche nach neuen Technologien und deren echtem Potenzial",
    "discoverMore": "Entdecke mehr über meine Interessen",
    "exploreMoreTitle": "Bereit, mehr zu erkunden?",
    "exploreMoreText": "Tauche tiefer in meine berufliche Reise, technische Expertise und die Projekte ein, die mich zu dem gemacht haben, was ich heute bin.",
    "technologiesCard": "Erkunde mein technisches Toolkit und sieh, wie ich moderne Entwicklungstechnologien einsetze",
    "projectsCard": "Entdecke die wirkungsvollen Software-Lösungen, die ich für verschiedene Branchen entwickelt habe",
    "hobbiesCard": "Lerne die Person hinter dem Code durch meine persönlichen Leidenschaften kennen",
    "contactCard": "Lass uns vernetzen und erkunden, wie wir bei deinem nächsten Projekt zusammenarbeiten können",
    "viewSkills": "Skills ansehen",
    "viewWork": "Projekte ansehen",
    "learnMore": "Mehr erfahren",
    "getInTouch": "Kontakt aufnehmen",
    "copyright": "© 2024 Enno Lohmann. Alle Rechte vorbehalten."
  },
  "technologies": {
    "title": "Technologien & Expertise",
    "subtitle": "Hier ist mein technisches Toolkit und die beruflichen Zertifizierungen, die meine Skills untermauern",
    "programmingLanguages": "PROGRAMMIERSPRACHEN",
    "frontendFrameworks": "FRONTEND-FRAMEWORKS",
    "backendFrameworks": "BACKEND-FRAMEWORKS",
    "databases": "DATENBANKEN",
    "cloudPlatforms": "CLOUD-PLATTFORMEN",
    "devopsTools": "DEVOPS & TOOLS",
    "certifications": "Berufliche Zertifizierungen",
    "certificationsSubtitle": "Branchenweit anerkannte Qualifikationen, die meine Expertise bestätigen"
  },
  "projects": {
    "title": "Projekte & Erfahrung",
    "subtitle": "Wirf einen Blick auf meine berufliche Arbeit und wichtigsten Beiträge in verschiedenen Branchen",
    "viewDetails": "Details ansehen",
    "technologies": "Technologien",
    "duration": "Dauer",
    "role": "Rolle"
  },
  "hobbies": {
    "title": "Hobbys & Interessen",
    "subtitle": "Leben jenseits des Codes – die Leidenschaften erkunden, die meine Kreativität befeuern und mich im Gleichgewicht halten",
    "learnMore": "Mehr erfahren"
  },
  "contact": {
    "title": "Lass uns vernetzen",
    "subtitle": "Bereit für eine Zusammenarbeit oder möchtest einfach nur Hallo sagen? Ich würde gerne von dir hören!",
    "email": "E-Mail",
    "phone": "Telefon",
    "location": "Standort",
    "social": "Social Media",
    "form": {
      "name": "Name",
      "email": "E-Mail",
      "subject": "Betreff",
      "message": "Nachricht",
      "send": "Nachricht senden",
      "sending": "Wird gesendet...",
      "success": "Nachricht erfolgreich gesendet!",
      "error": "Fehler beim Senden der Nachricht. Bitte versuche es erneut."
    }
  },
  "common": {
    "loading": "Lädt...",
    "error": "Etwas ist schiefgelaufen",
    "retry": "Nochmal versuchen",
    "close": "Schließen",
    "back": "Zurück",
    "next": "Weiter",
    "previous": "Vorherige"
  }
}
