{
  "nav": {
    "about": "About",
    "aboutDescription": "Get to know me",
    "technologies": "Technologies",
    "technologiesDescription": "My tech stack",
    "projects": "Projects",
    "projectsDescription": "What I've built",
    "hobbies": "Hobbies",
    "hobbiesDescription": "Life beyond code",
    "contact": "Contact",
    "contactDescription": "Let's connect",
    "language": "Language"
  },
  "home": {
    "title": "Enno Lohmann",
    "subtitle": "Fullstack Developer & Software Architect",
    "description": "I'm a passionate fullstack developer who loves crafting software solutions with Java and modern web frameworks. For over eight years, I've been helping clients across diverse industries turn their ideas into reality.",
    "experienceTitle": "EXPERIENCE",
    "experienceText": "Whether it's working with intimate three-developer teams or leading large-scale digital transformation projects with 120+ stakeholders, I thrive in collaborative environments where great ideas come to life through teamwork.",
    "qualityTitle": "QUALITY",
    "qualityText": "I believe in delivering software that truly makes a difference. Through clean, maintainable code, thorough testing, and smart performance optimization, I ensure every project meets the highest standards.",
    "stats": {
      "yearsExperience": "Years Experience",
      "projectStakeholders": "Project Stakeholders",
      "technologiesMastered": "Technologies Mastered"
    },
    "journeyTitle": "My Journey",
    "journeyText1": "My love for software development started over eight years ago, and it's been an incredible ride ever since. I've had the chance to work on everything from large-scale insurance platforms to cutting-edge case management systems for government agencies.",
    "journeyText2": "What really drives me is finding that sweet spot where technical excellence meets real human impact. Whether I'm building full-stack solutions with Java and Angular or designing cloud-native applications, I'm always thinking about the people who'll actually use what I create.",
    "journeyText3": "But here's what I've learned: the best software doesn't come from working in isolation. I love creating environments where knowledge flows freely—whether I'm mentoring junior developers or running cross-functional workshops. Great ideas come from bringing different perspectives together.",
    "currentFocusTitle": "Current Focus",
    "currentFocusText": "Right now, I'm leading full-stack development on next-generation insurance platforms. It's exciting work that combines modern web technologies with robust backend systems to completely transform how customers experience insurance services.",
    "philosophyTitle": "My Philosophy",
    "philosophyText": "Quality code isn't just about avoiding bugs—it's about building solutions that people can actually maintain, scale, and find genuinely useful. Every line of code should have a purpose and contribute to something bigger.",
    "beyondCodeTitle": "Beyond the Code",
    "beyondCodeText": "When I'm not building software, you'll find me exploring virtual worlds in my favorite games, training with my four-legged companions, or geeking out over the latest tech innovations.",
    "gamingTitle": "Gaming Enthusiast",
    "gamingText": "From strategic thinking in Age of Empires to conquering the challenging worlds of Dark Souls",
    "dogTrainingTitle": "Dog Training",
    "dogTrainingText": "Building strong bonds and clear communication with my four-legged companions",
    "techInnovationTitle": "Tech Innovation",
    "techInnovationText": "Always exploring emerging technologies and discovering their real-world potential",
    "discoverMore": "Discover more about my interests",
    "exploreMoreTitle": "Ready to Explore More?",
    "exploreMoreText": "Dive deeper into my professional journey, technical expertise, and the projects that have shaped who I am today.",
    "technologiesCard": "Explore my technical toolkit and see how I leverage modern development technologies",
    "projectsCard": "Discover the impactful software solutions I've built across diverse industries",
    "hobbiesCard": "Get to know the person behind the code through my personal passions",
    "contactCard": "Let's connect and explore how we can collaborate on your next project",
    "viewSkills": "View Skills",
    "viewWork": "View Work",
    "learnMore": "Learn More",
    "getInTouch": "Get in Touch",
    "copyright": "© 2024 Enno Lohmann. All rights reserved."
  },
  "technologies": {
    "title": "Technologies & Expertise",
    "subtitle": "Here's my technical toolkit and the professional certifications that back up my skills",
    "programmingLanguages": "PROGRAMMING LANGUAGES",
    "frontendFrameworks": "FRONTEND FRAMEWORKS",
    "backendFrameworks": "BACKEND FRAMEWORKS",
    "databases": "DATABASES",
    "cloudPlatforms": "CLOUD PLATFORMS",
    "devopsTools": "DEVOPS & TOOLS",
    "certifications": "Professional Certifications",
    "certificationsSubtitle": "Industry-recognized credentials that validate my expertise"
  },
  "projects": {
    "title": "Projects & Experience",
    "subtitle": "Take a look at my professional work and key contributions across various industries",
    "viewDetails": "View Details",
    "technologies": "Technologies",
    "duration": "Duration",
    "role": "Role"
  },
  "hobbies": {
    "title": "Hobbies & Interests",
    "subtitle": "Life beyond code—exploring the passions that fuel my creativity and keep me balanced",
    "learnMore": "Learn More"
  },
  "contact": {
    "title": "Let's Connect",
    "subtitle": "Ready to collaborate or just want to say hello? I'd love to hear from you!",
    "email": "Email",
    "phone": "Phone",
    "location": "Location",
    "social": "Social",
    "form": {
      "name": "Name",
      "email": "Email",
      "subject": "Subject",
      "message": "Message",
      "send": "Send Message",
      "sending": "Sending...",
      "success": "Message sent successfully!",
      "error": "Failed to send message. Please try again."
    }
  },
  "common": {
    "loading": "Loading...",
    "error": "Something went wrong",
    "retry": "Try Again",
    "close": "Close",
    "back": "Back",
    "next": "Next",
    "previous": "Previous"
  }
}
